/* No comment provided by engineer. */
"%@ of %@" = "%1$@ of %2$@";

/* FileList cell file info */
"%@ of %@, %@ downloaded" = "%1$@ of %2$@, %3$@ downloaded";

/* No comment provided by engineer. */
"%@ of %@, uploaded %@ (Ratio %0.2f)" = "%1$@ of %2$@, uploaded %3$@ (Ratio %4$.2f)";

/* RPC min verson supported */
"%@(min supported %@)" = "%1$@(min supported %2$@)";

/* No comment provided by engineer. */
"%@, uploaded %@ (Ratio %0.2f)" = "%1$@, uploaded %2$@ (Ratio %3$.2f)";

/* formatByRate */
"%@/s" = "%@/s";

/* FileList cell folder info */
"%i files, %@ of %@, %@ downloaded" = "%1$i files, %2$@ of %3$@, %4$@ downloaded";

/* RateLimitTable added title */
"%i KB/s" = "%i KB/s";

/* formateHoursMinutes */
"%ld hours %ld mins" = "%1$ld hours %2$ld mins";

/* formatByCount */
"0 KB" = "0 KB";

/* No comment provided by engineer. */
"100 Kb/s" = "100 Kb/s";

/* No comment provided by engineer. */
"1024 Kb/s" = "1024 Kb/s";

/* No comment provided by engineer. */
"150 Kb/s" = "150 Kb/s";

/* No comment provided by engineer. */
"200 Kb/s" = "200 Kb/s";

/* No comment provided by engineer. */
"2048 Kb/s" = "2048 Kb/s";

/* No comment provided by engineer. */
"250 Kb/s" = "250 Kb/s";

/* No comment provided by engineer. */
"50 Kb/s" = "50 Kb/s";

/* No comment provided by engineer. */
"500 Kb/s" = "500 Kb/s";

/* No comment provided by engineer. */
"750 Kb/s" = "750 Kb/s";

/* StatusCategory title */
"Active" = "Active";

/* No comment provided by engineer. */
"Add" = "Add";

/* No comment provided by engineer. */
"Add new server" = "Add new server";

/* Choose server controller title */
"Add torrent" = "Add torrent";

/* No comment provided by engineer. */
"Add torrent with file size: %@" = "%@\nSize %@";

/* No comment provided by engineer. */
"Add torrent with magnet link:\n%@" = "Add torrent with magnet link:\n%@";

/* Section title */
"Additional parameters" = "Additional parameters";

/* StatusCategory title */
"All" = "All";

"There is no selected server." = "There is no selected server";

"Files & Folders" = "Files & Folders";

/* No comment provided by engineer. */
"Autorefreshing is off.\nPull down to refresh data." = "Autorefreshing is off.\nPull down to refresh data.";

/* Alert view title */
"Can't add torrent" = "Can't add torrent";

/* No comment provided by engineer. */
"Cancel" = "Cancel";

/* StatusCategory title */
"Checking" = "Checking";

/* No comment provided by engineer. */
"Checking data ..." = "Checking data ...";

/* Section title */
"Choose server to add torrent" = "Server list";

/* Portinfo */
"CLOSED" = "CLOSED";

/* No comment provided by engineer. */
"Disablilng download speed limit" = "Disablilng download speed limit";

/* float info */
"Disabling upload speed limit" = "Disabling upload speed limit";

/* _speedLimitController title */
"Download speed limits" = "Download speed limits";

/* StatusCategory title */
"Downloading" = "Downloading";

/* No comment provided by engineer. */
"Downloading from %i of %i peers, ETA: %@" = "Downloading from %1$i of %2$i peers, ETA: %3$@";

/* No comment provided by engineer. */
"Edit" = "Edit";

/* RPCConfigController title */
"Edit server" = "Edit server";

/* StatusCategory title */
"Error" = "Error";

/* No comment provided by engineer. */
"Error: %@" = "Error: %@";

/* _fileListController title */
"Files" = "Files";

/* Free space fotter message */
"Free space: %@" = "Free space: %@";

/* FileListController nav left button title */
"Info" = "Info";

/* Speed limit table header */
"Limit download speed" = "Limit download speed";

/* Speed limit table header */
"Limit upload speed" = "Limit upload speed";

/* section title */
"List of configured servers" = "List of configured servers";

/* AppDelegate float message */
"New torrent has been added" = "New torrent has been added";

/* float info message */
"New torrent was added" = "New torrent was added";

/* No comment provided by engineer. */
"no activity" = "no activity";

/* RPCServerConfig timeouf message is OFF */
"OFF" = "OFF";

/* No comment provided by engineer. */
"OK" = "OK";

/* Portinfo */
"OPEN" = "OPEN";

/* TorrentListController torrent info */
"Paused" = "Paused";

/* _peerListController title */
"Peers" = "Peers";

/* No comment provided by engineer. */
"Remove" = "Remove";

/* No comment provided by engineer. */
"Remove torrent: %@?" = "Remove torrent: %@?";

/* No comment provided by engineer. */
"Remove with data" = "Remove with data";

/* No comment provided by engineer. */
"RPC Version: %@" = "RPC Version: %@";

/* No comment provided by engineer. */
"Save" = "Save";

/* StatusCategory title */
"Seeding" = "Seeding";

/* No comment provided by engineer. */
"Seeding to %i of %i peers" = "Seeding to %1$i of %2$i peers";

/* No comment provided by engineer. */
"Server failed to return data" = "Server failed to return data";

/* No comment provided by engineer. */
"Server failed to return data: %@" = "Server failed to return data: %@";

/* RPCServerConfig error message */
"Server port must be in range from 0 to 65535. By default server port number is 8090\n" = "Server port must be in range from 0 to 65535. By default server port number is 9091\n";

/* No comment provided by engineer. */
"Server response wrong data" = "Server response wrong data";

/* ServerListController title */
"Servers" = "Servers";

/* No comment provided by engineer. */
"Setting download speed limit to %i KB/s" = "Setting download speed limit to %i KB/s";

/* float info */
"Setting upload speed limit to %i KB/s" = "Setting upload speed limit to %i KB/s";

/* SessionConfigController title */
"Settings" = "Settings";

/* float info message */
"Settings have been saved" = "Settings have been saved";

/* StatusCategory title */
"Stopped" = "Stopped";

"trStopped" = "Paused";
"trSeeding" = "Seeding";
"trChecking" = "Verifying";
"trDownloading" = "Downloading";
"trError" = "Error";
"trWaiting" = "Queued";
"trWaitingSeed" = "Queued for Seeding";

/* Category empty title */
"There are no active torrents to show" = "There are no active torrents to show";

/* Category empty title */
"There are no checking torrents to show" = "There are no checking torrents to show";

/* Category empty title */
"There are no downloading torrents to show" = "There are no downloading torrents to show";

/* Category empty title */
"There are no error torrents to show" = "There are no error torrents to show";

/* PeerList background message */
"There are no peers avalable." = "There are no peers avalable.";

/* Category empty title */
"There are no seeding torrents to show" = "There are no seeding torrents to show";

/* Background info */
"There are no servers available add server to the list" = "There are no servers available.\nAdd server to the list";
"There are no servers available" = "There are no servers available";
"Add server to the list and try again" = "Add server to the list and try again";

/* Category empty title */
"There are no stopped torrents to show" = "There are no stopped torrents to show";

/* Category ALL emtpy title */
"There are no torrents to show" = "There are no torrents to show";

/* TorrentList background message */
"There are no torrents to show." = "There are no torrents to show.";

/* BgMessage */
"There is no selected server" = "There is no selected server";

/* No comment provided by engineer. */
"There is no selected server. Select server from list of servers." = "There is no selected server. Select server from list of servers.";

/* AlerView message OpenURL */
"There is no servers avalable" = "There are no servers avalable, please add server to the server list and try again later.";

/* TorrentInfoController title */
"Torrent details" = "Torrent details";

/* Sever list title */
"Servers" = "Servers";

/* float info message */
"Torrent is reannouncing ..." = "Torrent is reannouncing ...";

/* float info message */
"Torrent is starting ..." = "Torrent is starting ...";

/* float info message */
"Torrent is stopping ..." = "Torrent is stopping ...";

/* float info message */
"Torrent is verifying ..." = "Torrent is verifying ...";

/* float info message */
"Torrent was deleted" = "Torrent was deleted";

/* No comment provided by engineer. */
"\"%@\" has been downloaded\n" = "\"%@\" have been downloaded\n";

/* No comment provided by engineer. */
"Torrents" = "Torrents";

/* TorrentList start title */
"Transmission remote client" = "Transmission remote client";

/* No comment provided by engineer. */
"Type URL or MAGNET URL" = "Type URL or MAGNET URL";

/* ETA time string */
"unknown" = "unknown";

/* Speed limit */
"Unlimited" = "Unlimited";

/* StatusList header title */
"Updating ..." = "Updating ...";

/* _speedLimitController title */
"Upload speed limits" = "Upload speed limits";

/* ServerListController version */
"version %@(%@)" = "v %@(%@)";

/* No comment provided by engineer. */
"Wrong alternative download rate limit" = "Wrong alternative download rate limit";

/* No comment provided by engineer. */
"Wrong alternative upload rate limit" = "Wrong alternative upload rate limit";

/* No comment provided by engineer. */
"Wrong download rate limit" = "Wrong download rate limit";

/* No comment provided by engineer. */
"Wrong peers per torrent count" = "Wrong peers per torrent count";

/* No comment provided by engineer. */
"Wrong port number" = "Wrong port number";

/* No comment provided by engineer. */
"Wrong seed idle timeout number" = "Wrong seed idle timeout number";

/* No comment provided by engineer. */
"Wrong seed ratio limit factor" = "Wrong seed ratio limit factor";

/* No comment provided by engineer. */
"Wrong total peers count" = "Wrong total peers count";

/* No comment provided by engineer. */
"Wrong upload rate limit" = "Wrong upload rate limit";

/* No comment provided by engineer. */
"You are unauthorized to access server" = "You are unauthorized to access server";

/* RPCServerConfig error message */
"You should enter server HOST name\n" = "You should enter server HOST name\n";

/* RPCServerConfig error message */
"You should enter server NAME\n" = "You should enter server NAME\n";

/* RPCServerConfig error message */
"You should enter server RPC path. By default server rpc path is /transmission/rpc" = "You should enter server RPC path. By default server rpc path is /transmission/rpc";

/* No comment provided by engineer. */
"↑UL: %@" = "↑UL: %@";

/* No comment provided by engineer. */
"↑UL:%@ ↓DL:%@" = "↑UL:%@ ↓DL:%@";

/* No comment provided by engineer. */
"↓DL: %@" = "↓DL: %@";

"%i files, %@" = "%i files, %@";

"Select files to download" = "Select files/folders";

"\"%@\" has been downloaded\n" = "\"%@\" has been downloaded\n";

"Tracker list" = "Tracker list";

"Tracker has been removed" = "Tracker has been removed";

"There are no trackers to show" = "There are no trackers to show";

"Remove tracker:\n%@?" = "Remove tracker:\n%@?";

"Last announce time: %@ %@" = "Last announce time: %@ %@";
"Next announce time: %@" = "Next announce time: %@";
"Last scrape-announce time: %@ %@" = "Last scrape-announce time: %@ %@";
"Next scrape-announce time: %@" = "Next scrape-announce time: %@";
"Seeders: %i" = "Seeders: %i";
"Leechers: %i" = "Leechers: %i";
"Downloads: %i" = "Downloads: %i";
"Peers: %i" = "Peers: %i";

"Apply" = "Apply";

"Torrent settings has been applied" = "Torrent settings has been applied";

"Upload limit must be greater then zero" = "Upload limit must be greater then zero";
"Download limit must be greater then zero" = "Download limit must be greater then zero";
"Seed ratio limit must be greater then zero" = "Seed ratio limit must be greater then zero";
"Seed idle limit must be greater then zero" = "Seed idle limit must be greater then zero";

"You shoud set download directory"  = "You shoud set download directory";
"Schedule time" = "Schedule time";
"Select days" = "Days";

"On Mondays" = "On Mondays";
"On Tuesdays" = "On Tuesdays";
"On Wednesdays" = "On Wednesdays";
"On Thursdays" = "On Thursdays";
"On Fridays" = "On Fridays";
"On Saturdays" = "On Saturdays";
"On Sundays" = "On Sundays";

"Stopping all torrents ..." = "Stopping all torrents ...";
"Starting all torrents ..." = "Starting all torrents ...";

"Stop all torrents" = "Stop all torrents";
"Do you want to stop all torrents?" = "Do you want to stop all torrents?";
"Start all torrents" = "Start all torrents";
"Do you want to start all torrents?" = "Do you want to start all torrents?";

"Can not test port, %@" = "Can not test port, %@";
"Can not get free space, %@" = "Can not get free space, %@";
"Can not rename torrent, %@" = "Can not rename torrent, %@";

"testing ..." = "testing ...";

"Trackers" = "Trackers";

"Alternative limits is on" = "Alternative limits is on";
"Alternative limits is off" = "Alternative limits is off";

"Peers stats" = "Peers stats";

"Getting files for torrent ..." = "Getting files for torrent ...";

"Torrent size: " = "Torrent size: ";

"Can't get info for this ip\n%@" = "Can't get info for this IP. n%@";

"Can't get info for this ip, server error: %i\n%@" = "Can't get info for this IP.\nServer error: %i, %@";

"This ip belongs to some private net and location can not be detected" = "This ip belongs to some private net and location can not be detected";

"MagnetTorrentSizeUnknown" = "Unknown";
"MagnetTorrentNameUnknown" = "Unknown";
"MagnetHelpString" = "\n\nDon't forget to check wether DHT and PEX options are enabled in server settings";
"MagnetTorrentNameHash" = "Torrent hash: %@";

"TorrentInfoSizeFormat" = "%@ (%i pieces @%@)";
"TorrentUpDownSpeedFormat" = "↑%@ / ↓%@";

"Copy to buffer" = "Copy to buffer";

"Getting peers ..." = "Getting peers ...";

"Rename torrent" = "Rename torrent";
"Set new name of the torrent" = "Set new name of the torrent";
"Rename" = "Rename";

"Torrent has been renamed" = "Item has been renamed";

"Torrent pieces bitmap" = "Torrent pieces bitmap";

"Pieces count: %i" = "Pieces count: %i";
"Piece size: %@" = "Piece size: %@";
"Rows: %i" = "Rows: %i";
"Columns: %i" = "Columns: %i";

"AlertRenameFileTitle"  = "Rename File";
"AlertRenameFolderTitle" = "Rename Folder";
"AlertRenameFileText"   = "Type new name for file";
"AlertRenameFolderText" = "Type new name for folder";

"Long tap to rename file or folder" = "Long tap to rename file or folder";

/* open link menu */
"Open link menu" = "Open this Link";
"Open in Safari" ="Open in Safari";
"Open via Anonimizer" = "Open via Anonimizer";
"Copy" = "Copy";

/* waiting viewcontroller */
"Getting url" = "Getting URL ...";

/* ip anonimizer messages */
"HTTP status is not 200" = "Wrong HTTP answer";
"JSON response is incorrect" = "Server response is incorrect";
